Repository: Hazler/IrssiNotifierWP7
Catalog: IrssiNotifier/Resources/AppResources.*.resx
Languages: fi_fi

# AboutButtonText
source: About...
fi_fi: Tietoja...

# ApiTokenInfoText
source: This information can be later seen on settings view
fi_fi: Tämä tieto on myöhemmin nähtävillä asetusnäkymässä.

# ApiTokenText
source: Api Token for Irssi script:
fi_fi: Api Token Irssi-skriptiä varten:

# BackendErrorOccurredText
source: Web backend has changed notification settings because of error. Check the changed settings in settings view.
fi_fi: Web-sovellus on muuttanut notifikaatioasetuksia aiemmin sattuneen virheen vuoksi. Tarkista asetukset asetusnäkymässä.

# CancelButtonText
source: Cancel
fi_fi: Peruuta

# ConfirmLogoutText
source: Are you sure you want to log out?
fi_fi: Oletko varma että haluat kirjautua ulos?

# ConfirmLogoutTitle
source: Confirm logout
fi_fi: Vahvista uloskirjautuminen

source: Error fetching messages.
fi_fi: Virhe viestien noutamisessa

# ErrorFetchingMessagesEx
source: Error fetching messages: {0}
fi_fi: Virhe viestien noutamisessa: {0}

# ErrorGuidNotFound
source: Your phone is not registered or it's identification data has been changed. Please relogin.
fi_fi: Puhelintasi ei ole rekisteröity palveluun tai sen tunniste on muuttunut. Ole hyvä ja rekisteröi puhelin uudelleen.

# ErrorRegistration
source: Error on registration: {0}
fi_fi: Virhe rekisteröinnissä: {0}

# ErrorUserNotFound
source: User account not found. Please relogin.
fi_fi: Käyttäjätietojasi ei löytynyt palvelusta. Ole hyvä ja rekisteröidy uudelleen.

# FrontPageTitle
source: Front page
fi_fi: Etusivu

# HilitePivotAllTitle
source: All
fi_fi: Kaikki

# HilitePivotNewTitle
source: New
fi_fi: Uudet

# HilitePivotTitle
source: IRSSI NOTIFIER - hilites <3
fi_fi: IRSSI NOTIFIER - hailaitteja <3

# InfoNotificationChannelAutoOpened
source: Notification channel is opened automatically. Other settings can be altered in settings view.
fi_fi: Notifikaatiokanava avataan automaattisesti. Tarkista asetusnäkymästä muut asetukset.

# LiveTileRemovedText
source: Live tile has been deleted. Live tile notifications are disabled.
fi_fi: Livetiili poistettu. Poistetaan livetiili-päivitykset käytöstä.

# LoginTitle
source: Login
fi_fi: Kirjautuminen

# LogoutButtonText
source: Logout
fi_fi: Kirjaudu ulos

# MoreButtonText
source: More...
fi_fi: Lisää...

# PinLiveTileText
source: To use Live tile notifications you must pin Live tile into main screen. By selecting Ok live tile is created automatically.
fi_fi: Käyttääksesi livetiilitoimintoa sinun on kiinnitettävä tiili aloitusnäyttöön. Valitsemalla OK sovellus luo livetiilen automaattisesti.

# PinLiveTileTitle
source: Confirm pin of live tile
fi_fi: Vahvista tiilen lisäys

# PrivacyStatementText
source: You are forwarded to Google login page. Google doesn't reveal your password or any other private information for this application. Login is only used for identifying users. Google provides only anonyme identification information for this application.
fi_fi: Sinut ohjataan Googlen kirjautumissivulle. Google ei välitä tälle sovellukselle salasanaasi eikä muitakaan tilitietojasi. Kirjautumista käytetään ainoastaan käyttäjien yksilöintiin. Google välittää tälle sovellukselle ainoastaan anonyymejä yksilöintitietoja.

# PrivacyStatementTitle
source: Privacy statement.
fi_fi: Tietosuoja

# RefreshButtonText
source: Refresh
fi_fi: Päivitä

# RegisterButtonText
source: Register
fi_fi: Rekisteröidy

# SettingsButtonText
source: Settings
fi_fi: Asetukset

# SettingsMinimumToastIntervalHeader
source: Minimum time between toast notifications
fi_fi: Ponnahdusviestien vähimmäisväli

# SettingsMinimumToastIntervalText
source: Defines minimum time how often toast notifications are displayed.
fi_fi: Määrittelee miten pitkä aika kahden ponnahdusviestin välillä tulee vähintään olla.

# SettingsPushNotificationHeader
source: Push notifications
fi_fi: Notifikaatiopalvelu

# SettingsPushNotificationText
source: Turn on/off push notifications.
fi_fi: Avaa/Sulje notifikaatiokanava kokonaan

# SettingsTileNotificationHeader
source: Tile notifications
fi_fi: Livetiili

# SettingsTileNotificationText
source: Tile push notifications update the application's tile displayed in the Start Screen by telling count of unread messages. The tile must be pinned to start screen.
fi_fi: Päivittää aloitusvalikkoon kiinnitettyä livetiiltä kertoen lukemattomien viestien lukumäärän. Päälle kytkeminen vaatii livetiilen kiinnittämistä päävalikkoon.

# SettingsTitle
source: Settings
fi_fi: Asetukset

# SettingsToastNotificationHeader
source: Toast notifications
fi_fi: Ponnahdusviestit

# SettingsToastNotificationText
source: Toast push notifications show notification message in the top of the screen for ten seconds.
fi_fi: Näyttää ponnahdusviestin näytön yläreunassa 10 sekunnin ajan.

# ToastNotificationPermissionText
source: Do you want to allow app to use toast notifications?
fi_fi: Haluatko antaa sovelluksen käyttää ponnahdusviestipalvelua?

# ToastNotificationPermissionTitle
source: Allow toast notifications
fi_fi: Salli ponnahdusviestit

# WebsiteHelpInfoText
source: Instructions for configuring Irssi and installing Irssi script can be found from website:
fi_fi: Ohjeet Irssin konfiguroinnista ja skriptin asentamisesta löytyvät sovelluksen verkkosivuilta:

# WelcomeText1
source: To use the app you must register your phone for web backend.
fi_fi: Käyttääksesi sovellusta tulee sinun rekisteröidä puhelimesi palvelun käyttäjäksi.

# WelcomeText2
source: Google account is needed for registration and using of this app.
fi_fi: Rekisteröimiseen ja sovelluksen käyttämiseen tarvitset Google-tunnukset.

# WelcomeText3
source: Click "Register" to continue.
fi_fi: Klikkaa "Rekisteröidy" jatkaaksesi.

# WelcomeTextTitle
source: Welcome
fi_fi: Tervetuloa
